In [22]:
import pandas as pd
import numpy as np

In [23]:
data = pd.Series({"Name": 'sayan', "course": 'python'})
data

Name       sayan
course    python
dtype: object

In [24]:
type(data)

pandas.core.series.Series

In [25]:
data1 = pd.DataFrame({"Name":['sayan','smita', 'uttpal' ],"course": ['python','AI', 'DA']})
data1

     Name  course
0   sayan  python
1   smita      AI
2  uttpal      DA

In [26]:
data1.Name[2]

'uttpal'

In [27]:
data1.head()

     Name  course
0   sayan  python
1   smita      AI
2  uttpal      DA

In [28]:
data1.tail()

     Name  course
0   sayan  python
1   smita      AI
2  uttpal      DA

In [29]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   course  3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [30]:
data1.describe()

         Name  course
count       3       3
unique      3       3
top     sayan  python
freq        1       1

In [31]:
data1.head(2)

    Name  course
0  sayan  python
1  smita      AI

In [32]:
data1.rename(columns={'Name':'Student Name'})

  Student Name  course
0        sayan  python
1        smita      AI
2       uttpal      DA

In [33]:
data1.set_index('course', inplace = True)

In [34]:
data1

          Name
course
python   sayan
AI       smita
DA      uttpal

In [35]:
data1.isnull().sum()

Name    0
dtype: int64

In [56]:
data2 = pd.DataFrame({'Name': ['Bill Gates','Ambani','Adani'],'Salary': [400.0 , 150.0, np.nan]})

In [57]:
data2

         Name  Salary
0  Bill Gates   400.0
1      Ambani   150.0
2       Adani     NaN

In [58]:
data2.isnull()

    Name  Salary
0  False   False
1  False   False
2  False    True

In [59]:
data2.isnull().sum()

Name      0
Salary    1
dtype: int64

In [60]:
data2.describe()

           Salary
count    2.000000
mean   275.000000
std    176.776695
min    150.000000
25%    212.500000
50%    275.000000
75%    337.500000
max    400.000000

In [61]:
data2.dtypes

Name       object
Salary    float64
dtype: object

In [54]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Salary  2 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

In [62]:
data2.Salary.unique()

array([400., 150.,  nan])

In [65]:
for i in data2:
    print(i, data2[i].unique())

Name ['Bill Gates' 'Ambani' 'Adani']
Salary [400. 150.  nan]

In [66]:
#Statistical Function:

data2.max()

Name      Bill Gates
Salary         400.0
dtype: object

In [67]:
data2.min()

Name      Adani
Salary    150.0
dtype: object

In [68]:
data2.describe()

           Salary
count    2.000000
mean   275.000000
std    176.776695
min    150.000000
25%    212.500000
50%    275.000000
75%    337.500000
max    400.000000

In [71]:
#For object type data:

data2.describe(include= 'O')

              Name
count            3
unique           3
top     Bill Gates
freq             1

In [72]:
data2.describe(include= 'all')

              Name      Salary
count            3    2.000000
unique           3         NaN
top     Bill Gates         NaN
freq             1         NaN
mean           NaN  275.000000
std            NaN  176.776695
min            NaN  150.000000
25%            NaN  212.500000
50%            NaN  275.000000
75%            NaN  337.500000
max            NaN  400.000000